nxp-mcuxpresso/mcux-soc-svd/KW43L43Z93/KW43L43Z93.xml
        <cluster>
          <dim>3</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>OUTx_SEL[%s]</name>
          <description>Array of registers: OUT_SEL[%s]</description>
          <addressOffset>0x8</addressOffset>
          <register>
            <dim>2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>OUT_SEL[%s]</name>
            <description>Trigger Source IN0 to IN15 selector</description>
            <addressOffset>0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0xA8A80A02</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>IN0_SELn</name>
                <description>Selects ORed output of IRQ signal coming from digital glitch detector (dGDET) as a trigger source.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN4_SELn</name>
                <description>Selects IRQ coming from CDOG0 as a trigger source.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN5_SELn</name>
                <description>Selects IRQ coming from CDOG1 as a trigger source.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN9_SELn</name>
                <description>Selects IRQ coming from WDOG0 as a trigger source.</description>
                <bitOffset>18</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN10_SELn</name>
                <description>Selects IRQ coming from WDOG1 as a trigger source.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN11_SELn</name>
                <description>Selects UDF Error Event from udf_err output signal as a trigger source.</description>
                <bitOffset>22</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN13_SELn</name>
                <description>Selects Error Event from ORed output of IRQ signals from LVD HVD VDD_Core as a trigger source.</description>
                <bitOffset>26</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN15_SELn</name>
                <description>Selects Error Event only from HVD VDD_IO as a trigger source.</description>
                <bitOffset>30</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>3</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>OUTx_SEL_1[%s]</name>
          <description>Array of registers: OUT_SEL_1[%s]</description>
          <addressOffset>0x48</addressOffset>
          <register>
            <dim>2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>OUT_SEL_1[%s]</name>
            <description>Trigger Source IN16 to IN31 selector</description>
            <addressOffset>0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x802A0A2A</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>IN16_SELn</name>
                <description>Selects Error Event coming from AGDET VDD_CORE as a trigger source.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN17_SELn</name>
                <description>Selects TRDC ERROR EVENT, whenever MBC_Err_UPD is raised, as a trigger source.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN18_SELn</name>
                <description>Selects Output error event coming from out of range ADC Temperature sensor as a trigger source.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN20_SELn</name>
                <description>Selects GLIKEY Interrup as a trigger source.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN21_SELn</name>
                <description>Selects Glikey Error Signal from SECCON GLIKEY instance as a trigger source.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN24_SELn</name>
                <description>Selects error event coming from PKC block as a trigger source.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN25_SELn</name>
                <description>Error event coming from all detected errors output signal of SGI as a trigger source.</description>
                <bitOffset>18</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN26_SELn</name>
                <description>Error event flag coming from clock monitor as a trigger source.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN31_SELn</name>
                <description>Selects error event flag from Tamper 1 as a trigger source.</description>
                <bitOffset>30</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>3</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>OUTx_SEL_2[%s]</name>
          <description>Array of registers: OUT_SEL_2[%s]</description>
          <addressOffset>0x88</addressOffset>
          <register>
            <dim>2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>OUT_SEL_2[%s]</name>
            <description>Trigger source IN32 to IN47 selector</description>
            <addressOffset>0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x2AA</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>IN32_SELn</name>
                <description>Selects error event flag from Tamper 2 as a trigger source.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN33_SELn</name>
                <description>Selects error event flag from Tamper 3 as a trigger source.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN34_SELn</name>
                <description>Selects IRQ from Tamper Detect Pin Assert as a trigger source.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN35_SELn</name>
                <description>Selects SW Event 0 set by SW writing as a trigger source.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN36_SELn</name>
                <description>Selects SW Event 1 set by SW writing as a trigger source.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>SW_EVENT0</name>
          <description>Software event 0</description>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIGGER_SW_EVENT_0</name>
              <description>Trigger software event 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_EVENT1</name>
          <description>Software event 1</description>
          <addressOffset>0xF4</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIGGER_SW_EVENT_1</name>
              <description>Trigger software event 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
