nxp-mcuxpresso/mcux-soc-svd/KW43L43Z93/KW43L43Z93.xml
        <register>
          <name>ENTER_TIME_CAPT</name>
          <description>MAN Low Power Entry Time Captured</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENTER_TIME_CAPT</name>
              <description>Captured Timer count for MAN entry to low power</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WKUP_TIME_CAPT</name>
          <description>MAN Low Power Wakeup Time Captured</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WKUP_TIME_CAPT</name>
              <description>Captured Timer count for MAN exit from low power</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENTER_TIME</name>
          <description>MAN Low Power Entry Time Stamp</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENTER_TIME</name>
              <description>Timer count at which to initiate low power entry by the MAN.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WKUP_TIME</name>
          <description>MAN Low Power Wakeup Time Stamp</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WKUP_TIME</name>
              <description>Timer count at which to complete low power wakeup by the MAN.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RBME</name>
      <description>RBME</description>
      <groupName>RBME</groupName>
      <baseAddress>0x40106200</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CRCW_CFG</name>
          <description>CRC/WHITENER CONFIG</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CRCW_EN</name>
              <description>CRC calculation enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRCW_EC_EN</name>
              <description>CRC Error Correction Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC_ZERO</name>
              <description>CRC zero</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CRC_EARLY_FAIL</name>
              <description>CRC error correction fail</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CRC_RES_OUT_VLD</name>
              <description>CRC result output valid</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CRC_EC_OFFSET</name>
              <description>CRC error correction offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CRC_EC_DONE</name>
              <description>CRC error correction done</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CRC_EC_FAIL</name>
              <description>CRC error correction fail</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRC_EC_MASK</name>
          <description>CRC ERROR CORRECTION MASK</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CRC_EC_MASK</name>
              <description>CRC error correction mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRC_RES_OUT</name>
          <description>CRC RESULT</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CRC_RES_OUT</name>
              <description>CRC result output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCW_CFG2</name>
          <description>CRC/WHITENER CONFIG 2</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CRC_EC_SPKT_BYTES</name>
              <description>Error Correction Short Packet Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC_EC_SPKT_WND</name>
              <description>Error correction short packet burst error window</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC_EC_LPKT_WND</name>
              <description>Error correction long packet burst error window</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCW_CFG3</name>
          <description>CRC CONFIGURATION</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CRC_SZ</name>
              <description>CRC Size (in octets)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC_START_BYTE</name>
              <description>Configure CRC Start Point</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC_REF_IN</name>
              <description>CRC Reflect In</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC_REF_IN_0</name>
                  <description>Does not manipulate input data stream</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_REF_IN_1</name>
                  <description>reflect each byte in the input stream bitwise</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRC_REF_OUT</name>
              <description>CRC Reflect Out</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC_REF_OUT_0</name>
                  <description>Does not manipulate CRC result</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_REF_OUT_1</name>
                  <description>CRC result is to be reflected bitwise (operated on entire word)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRC_BYTE_ORD</name>
              <description>CRC Byte Order</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC_BYTE_ORD_0</name>
                  <description>LS Byte First</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_BYTE_ORD_1</name>
                  <description>MS Byte First</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CRC_INIT</name>
          <description>CRC INITIALIZATION</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CRC_SEED</name>
              <description>CRC Seed Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRC_POLY</name>
          <description>CRC POLYNOMIAL</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10210000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CRC_POLY</name>
              <description>CRC Polynomial.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRC_XOR_OUT</name>
          <description>CRC XOR OUT</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CRC_XOR_OUT</name>
              <description>CRC XOR OUT Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WHITEN_CFG</name>
          <description>WHITENER CONFIGURATION</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1FF0918</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WHITEN_START</name>
              <description>Configure Whitener Start Point</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WHITEN_START_0</name>
                  <description>no whitening</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WHITEN_START_1</name>
                  <description>start whitening at start-of-H0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WHITEN_START_2</name>
                  <description>start whitening at start-of-H1 but only if LENGTH &gt; WHITEN_SZ_THR</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WHITEN_START_3</name>
                  <description>start whitening at start-of-payload but only if LENGTH &gt; WHITEN_SZ_THR</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WHITEN_END</name>
              <description>Configure end-of-whitening</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WHITEN_END_0</name>
                  <description>end whiten at end-of-payload</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WHITEN_END_1</name>
                  <description>end whiten at end-of-crc</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WHITEN_B4_CRC</name>
              <description>Configure for Whitening-before-CRC</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WHITEN_B4_CRC_0</name>
                  <description>CRC before whiten/de-whiten</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WHITEN_B4_CRC_1</name>
                  <description>Whiten/de-whiten before CRC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WHITEN_POLY_TYPE</name>
              <description>Whiten Polynomial Type</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WHITEN_REF_IN</name>
              <description>Whiten Reflect Input</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WHITEN_PAYLOAD_REINIT</name>
              <description>Configure for Whitener re-initialization</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WHITEN_PAYLOAD_REINIT_0</name>
                  <description>Does not re-initialize Whitener LFSR at start-of-payload</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WHITEN_PAYLOAD_REINIT_1</name>
                  <description>Re-initialize Whitener LFSR at start-of-payload</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WHITEN_SIZE</name>
              <description>Length of Whitener LFSR</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WHITEN_INIT</name>
              <description>Initialization value for whitening/de-whitening</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WHITEN_POLY</name>
          <description>WHITENER POLYNOMIAL</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x21</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WHITEN_POLY</name>
              <description>Whitener Polynomial</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WHITEN_SZ_THR</name>
          <description>WHITENER SIZE THRESHOLD</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x800</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WHITEN_SZ_THR</name>
              <description>Whitener Size Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FEC_CFG1</name>
          <description>FEC CONFIG 1</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x300</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FEC_EN</name>
              <description>FEC enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FEC_EN_0</name>
                  <description>Disable FEC encoder and decoder</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FEC_EN_1</name>
                  <description>Enable FEC encoder and decoder</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FEC_SWAP</name>
              <description>FEC output swap</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FECOV_EN</name>
              <description>Enable dynamic override of FEC</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FECOV_EN_0</name>
                  <description>Disable FEC override</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FECOV_EN_1</name>
                  <description>The override of FEC is only used in Bluetooth LE LR cases, dynamically depending on the LR AA detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTV_EN</name>
              <description>Enable interleaver register</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEC_START_BYTE</name>
              <description>FEC Start Byte</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NTERM</name>
              <description>Number of term bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RBME_RST</name>
          <description>RBME SOFT RESET</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RBME_RST</name>
              <description>RBME reset signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RBME_RST_0</name>
                  <description>Disable soft reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RBME_RST_1</name>
                  <description>Enable soft reset. When this bit is write to 1, the soft reset to RBME happens immediately. Then all internal registers and functions will be reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RBME_CLK_EN_OVRD</name>
              <description>RBME Clock Enable override</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
