nxp-mcuxpresso/mcux-soc-svd/KW43L43Z93/KW43L43Z93.xml
        <register>
          <name>AGC_IDX6_GAIN_VAL</name>
          <description>AGC_IDX6_GAIN_VAL</description>
          <addressOffset>0xF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x77</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOG_GAIN_6</name>
              <description>LOG_GAIN_6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_HI_6</name>
              <description>Magnitude threshold high for AGC gain index 6</description>
              <bitOffset>10</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_6</name>
              <description>Magnitude threshold for AGC gain index 6</description>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX5_GAIN_VAL</name>
          <description>AGC_IDX5_GAIN_VAL</description>
          <addressOffset>0xFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOG_GAIN_5</name>
              <description>LOG_GAIN_5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_HI_5</name>
              <description>Magnitude threshold high for AGC gain index 5</description>
              <bitOffset>10</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_5</name>
              <description>Magnitude threshold for AGC gain index 5</description>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX4_GAIN_VAL</name>
          <description>AGC_IDX4_GAIN_VAL</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x49</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOG_GAIN_4</name>
              <description>LOG_GAIN_4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_HI_4</name>
              <description>Magnitude threshold high for AGC gain index 4</description>
              <bitOffset>10</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_4</name>
              <description>Magnitude threshold for AGC gain index 4</description>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX3_GAIN_VAL</name>
          <description>AGC_IDX3_GAIN_VAL</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x31</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOG_GAIN_3</name>
              <description>LOG_GAIN_3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_HI_3</name>
              <description>Magnitude threshold high for AGC gain index 3</description>
              <bitOffset>10</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_3</name>
              <description>Magnitude threshold for AGC gain index 3</description>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX2_GAIN_VAL</name>
          <description>AGC_IDX2_GAIN_VAL</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOG_GAIN_2</name>
              <description>LOG_GAIN_2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_HI_2</name>
              <description>Magnitude threshold high for AGC gain index 2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_2</name>
              <description>Magnitude threshold for AGC gain index 2</description>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX1_GAIN_VAL</name>
          <description>AGC_IDX1_GAIN_VAL</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOG_GAIN_1</name>
              <description>LOG_GAIN_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_HI_1</name>
              <description>Magnitude threshold high for AGC gain index 1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_1</name>
              <description>Magnitude threshold for AGC gain index 1</description>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX0_GAIN_VAL</name>
          <description>AGC_IDX0_GAIN_VAL</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3E4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOG_GAIN_0</name>
              <description>LOG_GAIN_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_HI_0</name>
              <description>Magnitude threshold high for AGC gain index 0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAG_THR_0</name>
              <description>Magnitude threshold for AGC gain index 0</description>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_THR_FAST</name>
          <description>AGC Fast Mode Threshold</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1C2001E</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_UP_THR_FAST</name>
              <description>Fast mode step up thresholds</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STEP_DOWN_THR_FAST</name>
              <description>Fast mode step down thresholds</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_THR_FAST_DRS</name>
          <description>AGC Fast Mode Threshold DRS</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1C2001E</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_UP_THR_FAST</name>
              <description>Fast mode step up thresholds for datarate_config_sel = 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STEP_DOWN_THR_FAST</name>
              <description>Fast mode step down thresholds for datarate_config_sel = 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX11_THR</name>
          <description>AGC IDX11 Slow Mode Threshold</description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1900000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_DOWN_THR_11</name>
              <description>STEP_DOWN_THR_11</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STEP_DOWN_THR_11_DRS_OFS</name>
              <description>STEP_DOWN_THR_11 DRS Offset</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX10_THR</name>
          <description>AGC IDX10 Slow Mode Threshold</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1900032</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_UP_THR_10</name>
              <description>STEP_UP_THR_10</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STEP_DOWN_THR_10</name>
              <description>STEP_DOWN_THR_10</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STEP_DOWN_THR_10_DRS_OFS</name>
              <description>STEP_DOWN_THR_10 DRS Offset</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX9_THR</name>
          <description>AGC IDX9 Slow Mode Threshold</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1900032</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_UP_THR_9</name>
              <description>STEP_UP_THR_9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STEP_DOWN_THR_9</name>
              <description>STEP_DOWN_THR_9</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STEP_DOWN_THR_9_DRS_OFS</name>
              <description>STEP_DOWN_THR_9 DRS Offset</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX8_THR</name>
          <description>AGC IDX8 Slow Mode Threshold</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1900032</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_UP_THR_8</name>
              <description>STEP_UP_THR_8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STEP_DOWN_THR_8</name>
              <description>STEP_DOWN_THR_8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STEP_DOWN_THR_8_DRS_OFS</name>
              <description>STEP_DOWN_THR_8 DRS Offset</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX7_THR</name>
          <description>AGC IDX7 Slow Mode Threshold</description>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1900032</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_UP_THR_7</name>
              <description>STEP_UP_THR_7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STEP_DOWN_THR_7</name>
              <description>STEP_DOWN_THR_7</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STEP_DOWN_THR_7_DRS_OFS</name>
              <description>STEP_DOWN_THR_7 DRS Offset</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX6_THR</name>
          <description>AGC IDX6 Slow Mode Threshold</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1900032</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_UP_THR_6</name>
              <description>STEP_UP_THR_6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STEP_DOWN_THR_6</name>
              <description>STEP_DOWN_THR_6</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STEP_DOWN_THR_6_DRS_OFS</name>
              <description>STEP_DOWN_THR_6 DRS Offset</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX5_THR</name>
          <description>AGC IDX5 Slow Mode Threshold</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1900032</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_UP_THR_5</name>
              <description>STEP_UP_THR_5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STEP_DOWN_THR_5</name>
              <description>STEP_DOWN_THR_5</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STEP_DOWN_THR_5_DRS_OFS</name>
              <description>STEP_DOWN_THR_5 DRS Offset</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX4_THR</name>
          <description>AGC IDX4 Slow Mode Threshold</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1900032</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_UP_THR_4</name>
              <description>STEP_UP_THR_4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STEP_DOWN_THR_4</name>
              <description>STEP_DOWN_THR_4</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STEP_DOWN_THR_4_DRS_OFS</name>
              <description>STEP_DOWN_THR_4 DRS Offset</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX3_THR</name>
          <description>AGC IDX3 Slow Mode Threshold</description>
          <addressOffset>0x13C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1900032</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_UP_THR_3</name>
              <description>STEP_UP_THR_3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STEP_DOWN_THR_3</name>
              <description>STEP_DOWN_THR_3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STEP_DOWN_THR_3_DRS_OFS</name>
              <description>STEP_DOWN_THR_3 DRS Offset</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX2_THR</name>
          <description>AGC IDX2 Slow Mode Threshold</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1900032</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_UP_THR_2</name>
              <description>STEP_UP_THR_2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STEP_DOWN_THR_2</name>
              <description>STEP_DOWN_THR_2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STEP_DOWN_THR_2_DRS_OFS</name>
              <description>STEP_DOWN_THR_2 DRS Offset</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX1_THR</name>
          <description>AGC IDX1 Slow Mode Threshold</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1900032</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_UP_THR_1</name>
              <description>STEP_UP_THR_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STEP_DOWN_THR_1</name>
              <description>STEP_DOWN_THR_1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STEP_DOWN_THR_1_DRS_OFS</name>
              <description>STEP_DOWN_THR_1 DRS Offset</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_IDX0_THR</name>
          <description>AGC IDX0 Slow Mode Threshold</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x32</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_UP_THR_0</name>
              <description>STEP_UP_THR_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
