nxp-mcuxpresso/mcux-soc-svd/KW43L43Z93/KW43L43Z93.xml
        <register>
          <name>BLE_REG_DEBUG_BANK_SEL</name>
          <description>BLE debug test bus bank selection set</description>
          <addressOffset>0xE14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>testbus_bank_select_1</name>
              <description>BLE debug test bus selection [3:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>testbus_bank_select_2</name>
              <description>BLE debug test bus selection [7:4]</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>testbus_bank_select_3</name>
              <description>BLE debug test bus selection [11:8]</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>testbus_bank_select_4</name>
              <description>BLE debug test bus selection [15:12]</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_IP_REVISION</name>
          <description>BTU IP Revision</description>
          <addressOffset>0xE20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x2800</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BTU_IP_Rev</name>
              <description>BLE IP Revision</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_AES_MARGIN</name>
          <description>BLE AES Margin</description>
          <addressOffset>0xE30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3FF03FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ble_tx_aes_mrgn_min</name>
              <description>ble_tx_aes_mrgn_min</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ble_tx_aes_ur</name>
              <description>ble_tx_aes_ur</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ble_tx_aes_mrgn_en</name>
              <description>ble_tx_aes_mrgn_en</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_rx_aes_mrgn_min</name>
              <description>ble_rx_aes_mrgn_min</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ble_rx_aes_ur</name>
              <description>ble_rx_aes_ur</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ble_rx_aes_mrgn_en</name>
              <description>ble_rx_aes_mrgn_en</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_DMA_MARGIN</name>
          <description>BLE DMA Margin</description>
          <addressOffset>0xE34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3FF03FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ble_tx_dma_mrgn_min</name>
              <description>ble_tx_dma_mrgn_min</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ble_tx_dma_uf</name>
              <description>ble_tx_dma_uf</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ble_tx_dma_mrgn_en</name>
              <description>ble_tx_dma_mrgn_en</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_rx_dma_mrgn_min</name>
              <description>ble_rx_dma_mrgn_min</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ble_dfe_dma_of</name>
              <description>ble_dfe_dma_of</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ble_rx_dma_of</name>
              <description>ble_rx_dma_of</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ble_rx_dma_mrgn_en</name>
              <description>ble_rx_dma_mrgn_en</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_AHB_LAT</name>
          <description>BLE AHB Latency Monitors</description>
          <addressOffset>0xE3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ble_slv_txn_max</name>
              <description>ble_slv_txn_max</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ble_mst_txn_max</name>
              <description>ble_mst_txn_max</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ble_mst_arb_max</name>
              <description>ble_mst_arb_max</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ble_slv_txn_en</name>
              <description>ble_slv_txn__en</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_mst_txn_en</name>
              <description>ble_mst_txn_en</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_mst_arb_en</name>
              <description>ble_mst_arb_en</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_DEBUG_RVSD</name>
          <description>Debug reserved</description>
          <addressOffset>0xE80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ble_cpu_gatehclk_sel</name>
              <description>BLE CPU Gatehclk Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>gatehclk connected to GATEHCLK port from BLE CPU</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>gatehclk connected to SLEEPING port from BLE CPU</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ble_sw_mbox_clr_en</name>
              <description>BLE SW_Mbox_Clr_En</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_mask_req_at_sleep_req_range</name>
              <description>BLE Mask Request at Sleep_Req_Range</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_mbox_req_delay</name>
              <description>BLE Mbox Request Delay</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_soc_req_mode</name>
              <description>BLE SoC Request Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_clk_ctrl_soc_req_cdc_fix</name>
              <description>BLE_SoC_Req CDC Fix</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>BLE_SoC_Req reverts to original without CDC Fix</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>fix for SoC_Req is new</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>debug_rvsd</name>
              <description>Debug Reserved</description>
              <bitOffset>6</bitOffset>
              <bitWidth>26</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
