nxp-mcuxpresso/mcux-soc-svd/KW43L43Z93/KW43L43Z93.xml
        <register>
          <name>GENERAL_REG_3</name>
          <description>General Register 3</description>
          <addressOffset>0x20C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GENERAL_REG</name>
              <description>General Bit Field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUTHENTICATE</name>
          <description>Protect SYSCON registers from unintentional writes</description>
          <addressOffset>0xF00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DUMMY_LOCK</name>
              <description>SYSCON Write Access Lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DUMMY_LOCK_2863311530</name>
                  <description>Unlock SYSCON registers write restriction, any other value will lock SYSCON registers</description>
                  <value>0xAAAAAAAA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SECCON</name>
      <description>Secure System Controller</description>
      <groupName>SECCON</groupName>
      <baseAddress>0x4019F000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x240</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SECCON0</name>
        <value>22</value>
      </interrupt>
      <registers>
        <register>
          <name>CPU1_RESET_CTRL</name>
          <description>CPU1 Reset Controller</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA0000A0A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU1_RESET</name>
              <description>CPU1_RESET</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU1_RESET_10</name>
                  <description>Reset CPU1, any other value will clear Reset of CPU1</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU1_VECTOR_LOCK</name>
              <description>CPU1_VECTOR_LOCK</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU1_VECTOR_LOCK_10</name>
                  <description>Unlock CPU1_VECTOR, any other value will lock CPU1_VECTOR.</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU1_RESET_CTRL_LOCK</name>
              <description>CPU1_RESET_CTRL_LOCK</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU1_RESET_CTRL_LOCK_10</name>
                  <description>Unlock CPU1_CTRL_RESET until next warm reset, any other value will lock CPU1_CTRL_RESET.</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU1_VECTOR</name>
          <description>CPU1 Initial Vector Set</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU1_INITVTOR</name>
              <description>CPU1_INITVTOR</description>
              <bitOffset>7</bitOffset>
              <bitWidth>25</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GENERAL_BLOCK_0_0</name>
          <description>GEN_BLK_0_0</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GEN_BLK_0_0</name>
              <description>GEN_BLK_0 Part 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GENERAL_BLOCK_0_1</name>
          <description>GEN_BLK_0_1</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GEN_BLK_0_1</name>
              <description>GEN_BLK_0 Part 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GENERAL_BLOCK_0_2</name>
          <description>GEN_BLK_0_2</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GEN_BLK_0_2</name>
              <description>GEN_BLK_0 Part 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GENERAL_BLOCK_0_3</name>
          <description>GEN_BLK_0_3</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GEN_BLK_0_3</name>
              <description>GEN_BLK_0 Part 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GENERAL_BLOCK_1_0</name>
          <description>GEN_BLK_1_0</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GEN_BLK_1_0</name>
              <description>GEN_BLK_1 Part 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GENERAL_BLOCK_1_1</name>
          <description>GEN_BLK_1_1</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GEN_BLK_1_1</name>
              <description>GEN_BLK_1 Part 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GENERAL_BLOCK_1_2</name>
          <description>GEN_BLK_1_2</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GEN_BLK_1_2</name>
              <description>GEN_BLK_1 Part 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GENERAL_BLOCK_1_3</name>
          <description>GEN_BLK_1_3</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GEN_BLK_1_3</name>
              <description>GEN_BLK_1 Part 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UDF_CTRL</name>
          <description>UDF_CTRL</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x13140004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UDF_CTL_CONST_SEL</name>
              <description>UDF_CTL_CONST_SEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UDF_CTL_CONST_SEL_0</name>
                  <description>Select TestKey</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UDF_CTL_CONST_SEL_1</name>
                  <description>Select DUK</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UDF_CTL_CONST_SEL_2</name>
                  <description>DeviceHSM</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UDF_CTL_CONST_SEL_3</name>
                  <description>NXP_mROT</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UDF_CTL_CONST_SEL_LOCK</name>
              <description>UDF_CTL_CONST_SEL_LOCK</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UDF_CTL_CONST_SEL_LOCK_0</name>
                  <description>Disable write data to UDF_CTL_CONST_SEL bit-field</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UDF_CTL_CONST_SEL_LOCK_1</name>
                  <description>Enable write data to UDF_CTL_CONST_SEL bit-field</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UDF_HIDDEN</name>
              <description>UDF_HIDDEN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UDF_HIDDEN_4884</name>
                  <description>Enable the access of UDF register from APB bus. Any other value will hide UDF, disable the read/write of UDF register from UDF APB bus.</description>
                  <value>0x1314</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVICE_UID_0</name>
          <description>Device UID 0</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UID0</name>
              <description>Device Unique ID part 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVICE_UID_1</name>
          <description>Device UID 1</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UID1</name>
              <description>Device Unique ID part 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVICE_UID_2</name>
          <description>Device UID 2</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UID2</name>
              <description>Device Unique ID part 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVICE_UID_3</name>
          <description>Device UID 3</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UID3</name>
              <description>Device Unique ID part 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GDET0_CTRL</name>
          <description>GDET0 Control</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GDET_EVTCNT_CLR</name>
              <description>GDET Event Counter Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GDET_EVTCNT_CLR_0</name>
                  <description>Not clear</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GDET_EVTCNT_CLR_1</name>
                  <description>Clears</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GDET_ERR_CLR</name>
              <description>GDET Error Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GDET_ERR_CLR_0</name>
                  <description>Not clear</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GDET_ERR_CLR_1</name>
                  <description>Clears</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GDET_ISO_CTR</name>
              <description>GDET Isolation Control</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GDET_ISO_CTR_0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GDET_ISO_CTR_1</name>
                  <description>Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GDET_ISO_CTR_2</name>
                  <description>Enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GDET_ISO_CTR_3</name>
                  <description>Disabled</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVENT_CNT</name>
              <description>Event Count Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>POS_SYNC</name>
              <description>Positive Glitch Detection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POS_SYNC_0</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POS_SYNC_1</name>
                  <description>Detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NEG_SYNC</name>
              <description>Negative Glitch Detection</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEG_SYNC_0</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEG_SYNC_1</name>
                  <description>Detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVENT_CLR_FLAG</name>
              <description>Event Counter Clear</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EVENT_CLR_FLAG_0</name>
                  <description>Not cleared</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENT_CLR_FLAG_1</name>
                  <description>Cleared</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LC_PROBE_STATE</name>
          <description>LC_PROBE_STATE</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LC_PROBE_STATE</name>
              <description>LC_PROBE_STATE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LC_FT_STATE_A</name>
          <description>LC_FT_STATE_A</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LC_FT_STATE_A</name>
              <description>LC_FT_STATE_A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LC_FT_STATE_B</name>
          <description>LC_FT_STATE_B</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LC_FT_STATE_B</name>
              <description>LC_FT_STATE_B</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
