nxp-mcuxpresso/mcux-soc-svd/KW43L43Z93/KW43L43Z93.xml
        <register>
          <name>DEBUG_FEATURE_LOCK</name>
          <description>Controls write access to Debug Security registers</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA0AAAAAA</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU0_DBGEN_LOCK</name>
              <description>Controls write access to the CPU0 invasive debug control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU0_DBGEN_LOCK_10</name>
                  <description>Enables write access to all registers, any other value rather than 4'b1010 will disable write access to all registers. Once write value rather than 4'b1010, this bit field will be locked.</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU0_NIDEN_LOCK</name>
              <description>Controls write access to the CPU0 non-invasive debug control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU0_NIDEN_LOCK_10</name>
                  <description>Enables write access to all registers, any other value rather than 4'b1010 will disable write access to all registers. Once value other than 4'b1010 is written, this bit field will be locked.</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU0_SPIDEN_LOCK</name>
              <description>Controls write access to the CPU0 secure privileged invasive debug control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU0_SPIDEN_LOCK_10</name>
                  <description>Enables write access to all registers, any other value rather than 4'b1010 will disable write access to all registers. Once value other than 4'b1010 is written, this bit field will be locked.</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU0_SPNIDEN_LOCK</name>
              <description>Controls write access to the CPU0 secure privileged non-invasive debug control</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU0_SPNIDEN_LOCK_10</name>
                  <description>Enables write access to all registers, any other value rather than 4'b1010 will disable write access to all registers. Once value other than 4'b1010 is written, this bit field will be locked.</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU1_DBGEN_LOCK</name>
              <description>Controls write access to the CPU1 debug related registers</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU1_DBGEN_LOCK_10</name>
                  <description>Enables write access to all registers, any other value rather than 4'b1010 will disable write access to all registers. Once value other than 4'b1010 is written, this bit field will be locked.</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU1_NIDEN_LOCK</name>
              <description>Controls write access to the CPU1 debug related registers</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU1_NIDEN_LOCK_10</name>
                  <description>Enables write access to all registers, any other value rather than 4'b1010 will disable write access to all registers. Once value other than 4'b1010 is written, this bit field will be locked.</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEBUG_AUTH_BEACON_LOCK</name>
              <description>Controls write access to the DEBUG_AUTH_BEACON</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEBUG_AUTH_BEACON_LOCK_10</name>
                  <description>Enables write access to DEBUG_AUTH_BEACON registers, any other value rather than 4'b1010 will disable write access to all registers. Once value other than 4'b1010 is written, this bit field will be locked.</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TEST_ACCESS_EN</name>
          <description>Security Code to Allow Test (Design for Testability) access.</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x61C88646</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TEST_ACCESS_ENABLE</name>
              <description>Test Infra Access Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TEST_ACCESS_ENABLE_1640531526</name>
                  <description>Access to test port/infrastructure is disabled.</description>
                  <value>0x61C88646</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_ACCESS_ENABLE_2654435769</name>
                  <description>Access to test port/infrastructure is enabled.</description>
                  <value>0x9E3779B9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_ACCESS_EN</name>
          <description>Flash Test Access Enable Control</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x55</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLASH_ACCESS_ENABLE</name>
              <description>Flash Test Access Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_ACCESS_ENABLE_10</name>
                  <description>Access Enable, any other value means access disable</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFR1_ACCESS_ENABLE</name>
              <description>Flash IFR1 Test Access Control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IFR1_ACCESS_ENABLE_10</name>
                  <description>Access Enable, any other value means access disable</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SWD_ACCESS_CPU0</name>
          <description>CPU0 Software Debug Access</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU0_SWD_ACCESS_ENABLE</name>
              <description>CPU0 SWD AP Access Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU0_SWD_ACCESS_ENABLE_10</name>
                  <description>Access Enable, any other value means access disable</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SWD_ACCESS_CPU1</name>
          <description>CPU1 Software Debug Access</description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU1_SWD_ACCESS_ENABLE</name>
              <description>CPU1 SWD AP Access Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU1_SWD_ACCESS_ENABLE_10</name>
                  <description>Access Enable, any other value means access disable</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_PASSWORD_MATCH</name>
          <description>L2 Password Has Matched</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>L2_PASSWORD_MATCHED</name>
              <description>L2 PASSWORD HAS MATCHED</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L2_PASSWORD_MATCHED_0</name>
                  <description>Not Match</description>
                  <value>0x0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L2_PASSWORD_MATCHED_23130</name>
                  <description>Matched</description>
                  <value>0x5A5A</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_PASSWORD_MATCH_HIDE</name>
          <description>Hide L2_PASSWORD_MATCH Reg</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MATCH_HIDE</name>
              <description>Hide info of L2_PASSWORD_MATCH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MATCH_HIDE_10</name>
                  <description>Unhide the information in L2_PASSWORD_MATCH register, any other value rather than 4'b1010 will hide L2_PASSWORD_MATCH</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SOC_ERSIEN</name>
          <description>Flash IFR0 Erase Enable</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SECTOR_0_ERASE_EN</name>
              <description>Erase IFR Sector Enable - Block 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECTOR_0_ERASE_EN_0</name>
                  <description>Block 0 IFR Sector X is protected from erase by ERSSCR command</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECTOR_0_ERASE_EN_1</name>
                  <description>Block 0 IFR Sector X is not protected from erase by ERSSCR command</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SECTOR_1_ERASE_EN</name>
              <description>Erase IFR Sector Enable - Block 1 (for dual block configs)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECTOR_1_ERASE_EN_0</name>
                  <description>Block 1 IFR Sector X is protected from erase by ERSSCR command</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECTOR_1_ERASE_EN_1</name>
                  <description>Block 1 IFR Sector X is not protected from erase by ERSSCR command</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASS_ERASE_EN</name>
              <description>Mass erase control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASS_ERASE_EN_0</name>
                  <description>Disables mass erase</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASS_ERASE_EN_1</name>
                  <description>Enables mass erase</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOT_LOCKOUT_ADDR</name>
          <description>ROM Hidden XOM address offset</description>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HIDDEN_ADDR_OFFSET</name>
              <description>ROM Address Range To Lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XOM_ADDR_OFFSET</name>
              <description>XOM address offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOT_LOCKOUT_ADDR_DP</name>
          <description>ROM Hidden XOM address offset duplicate</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HIDDEN_ADDR_OFFSET_DP</name>
              <description>ROM Address Range To Lock (Duplicate)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XOM_ADDR_OFFSET_DP</name>
              <description>XOM address offset (Duplicate)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOT_LOCKOUT_LOCK</name>
          <description>Control write access to BOOT_LOCKOUT_ADDR</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3CC35AA5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ROM_LOCK</name>
              <description>ROM Address Lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOT_RETRY_CNT</name>
          <description>Boot Retry Counter</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BOOT_RETRY_CNT</name>
              <description>Boot retry counter bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOT_TEMP_STATE</name>
          <description>Boot Temporal State</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BOOT_TEMP_STATE_CNT</name>
              <description>Temporal state counter bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOT_ATTEST_STATE_0</name>
          <description>Store boot attest state</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BOOT_ATTEST_STATE_0</name>
              <description>BOOT ATTEST STATE 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOT_ATTEST_STATE_1</name>
          <description>Store boot attest state</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BOOT_ATTEST_STATE_1</name>
              <description>BOOT ATTEST STATE 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOT_ATTEST_STATE_2</name>
          <description>Store boot attest state</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BOOT_ATTEST_STATE_2</name>
              <description>BOOT ATTEST STATE 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOT_ATTEST_STATE_3</name>
          <description>Store boot attest state</description>
          <addressOffset>0x15C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BOOT_ATTEST_STATE_3</name>
              <description>BOOT ATTEST STATE 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOT_ATTEST_STATE_4</name>
          <description>Store boot attest state</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BOOT_ATTEST_STATE_4</name>
              <description>BOOT ATTEST STATE 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOT_ATTEST_STATE_5</name>
          <description>Store boot attest state</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BOOT_ATTEST_STATE_5</name>
              <description>BOOT ATTEST STATE 5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
