nxp-mcuxpresso/mcux-soc-svd/KW43L43Z93/KW43L43Z93.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>RFMC</name>
      <description>RFMC</description>
      <groupName>RFMC</groupName>
      <baseAddress>0x401A3000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x58</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>VERID</name>
          <description>RFMC Version ID Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x2004800</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RADIO_ID</name>
              <description>Radio Identification Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MINOR</name>
              <description>Minor RFMC Version Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>Major RFMC Version Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAM</name>
          <description>RFMC Parameter Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RF2p4GHz_EN</name>
              <description>Indicates whether 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RF2p4GHz_EN_0</name>
                  <description>2.4GHz radio disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RF2p4GHz_EN_1</name>
                  <description>2.4GHz radio enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>RFMC Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RFMC_RST</name>
              <description>S/W System Reset for RFMC</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RFMC_RST_0</name>
                  <description>Release the RFMC from reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFMC_RST_1</name>
                  <description>Hold the RFMC in reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>XO_CTRL</name>
          <description>XO Control Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x220000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDY_IE</name>
              <description>XTAL Ready Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RDY_IE_0</name>
                  <description>XTAL ready interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY_IE_1</name>
                  <description>XTAL ready interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_IE</name>
              <description>XO Internal Request Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_IE_0</name>
                  <description>XO internal request interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_IE_1</name>
                  <description>XO internal request interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXT_IE</name>
              <description>XO External Request Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXT_IE_0</name>
                  <description>XO external request interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_IE_1</name>
                  <description>XO external request interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTAL_OUT_EN</name>
              <description>XTAL_OUT Output Pin Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTAL_OUT_EN_0</name>
                  <description>XTAL_OUT output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_OUT_EN_1</name>
                  <description>XTAL_OUT output enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTAL_REQ_OBE</name>
              <description>XTAL_REQ Output Pin Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTAL_REQ_OBE_0</name>
                  <description>XTAL_REQ output pin disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_REQ_OBE_1</name>
                  <description>XTAL_REQ output pin enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTAL_EN_IBE</name>
              <description>XTAL_OUT_EN Input Pin Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTAL_EN_IBE_0</name>
                  <description>XTAL_OUT_EN input pin disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_EN_IBE_1</name>
                  <description>XTAL_OUT_EN input pin enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUP_OFFSET</name>
              <description>XO Wakeup Offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDY_CNT</name>
              <description>XTAL Ready Count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RDY_CNT_0</name>
                  <description>1024</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY_CNT_1</name>
                  <description>2048</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY_CNT_2</name>
                  <description>4096</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY_CNT_3</name>
                  <description>8192</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDY_CNT_OFF</name>
              <description>XTAL Ready Count Disable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RDY_CNT_OFF_0</name>
                  <description>XTAL Ready Count Enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY_CNT_OFF_1</name>
                  <description>XTAL Ready Count Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTAL_OUT_INV</name>
              <description>XO Clock Output Invert</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTAL_OUT_INV_0</name>
                  <description>XTAL_OUT not inverted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_OUT_INV_1</name>
                  <description>XTAL_OUT inverted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO_BYPASS</name>
              <description>XO LDO Bypass</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXT_MODE</name>
              <description>External Clock Mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXT_MODE_0</name>
                  <description>DC coupled external clock mode (amplifier powered down).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_MODE_1</name>
                  <description>AC coupled external clock mode or crystal mode (amplifier powered up).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTAL_RDY_OVR_EN</name>
              <description>XTAL Ready Override Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_RDY_OVR</name>
              <description>XTAL Ready Override</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPARE</name>
              <description>XO Spare Registers</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XO_LDO_OVR</name>
              <description>XO LDO Enable Override</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XO_LDO_OVR_0</name>
                  <description>XO LDO enable not overridden</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XO_LDO_OVR_1</name>
                  <description>XO LDO enable overridden by XO_LDO_EN bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XO_LDO_EN</name>
              <description>XO LDO Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XO_LDO_EN_0</name>
                  <description>XO LDO disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XO_LDO_EN_1</name>
                  <description>XO LDO enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XO_ANA_OVR</name>
              <description>XO Analog Enable Override</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XO_ANA_OVR_0</name>
                  <description>XO analog enable not overridden</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XO_ANA_OVR_1</name>
                  <description>XO analog enable overridden by XO_ANA_EN bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XO_ANA_EN</name>
              <description>XO Analog Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XO_ANA_EN_0</name>
                  <description>XO analog disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XO_ANA_EN_1</name>
                  <description>XO analog enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>XO_STAT</name>
          <description>XO Status Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDY_FLAG</name>
              <description>XTAL Ready Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>INT_FLAG</name>
              <description>XO Internal Request Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>EXT_FLAG</name>
              <description>XO External Request Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>XTAL_RDY</name>
              <description>XTAL Ready</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>XO_EN</name>
              <description>XO_EN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
